[PAD]
[UNK]
？
，
！
。
9981
9979
9963
9955
9935
9925
9907
9895
9866
9815
9810
9805
979
9765
976
9755
9737
9707
97
9680
9672
9614
9601
9597
9565
9538
9534
9531
9528
9508
9507
9498
945
9428
9426
9421
9410
9379
9376
9351
929
9283
9273
927
924
9210
9198
9155
9115
9108
9100
9062
9053
9043
9042
9023
9019
9007
9000
8997
8984
8943
8935
8875
8868
8856
8842
884
881
8808
8766
8750
8739
8711
8679
8641
8619
8612
8579
8565
854
8503
85
8482
8456
8414
84
8366
8347
8346
8335
8327
8322
8313
8311
83
8299
8282
8266
8258
8251
8237
8222
8212
8209
8208
8202
8194
8169
8164
8147
8146
8139
8137
8126
8100
8073
8067
8057
8045
803
8022
8019
8
7994
7990
7961
7923
7918
7915
7875
7868
7848
7821
781
7805
7800
7799
7787
7740
7710
7690
768
7659
7634
760
7598
7558
7548
7547
7531
752
7493
749
7481
7469
7442
7440
7424
7419
7390
7386
7360
7269
726
7232
7230
7211
7158
7154
715
7077
7052
705
6989
6987
6984
698
697
6964
6884
6872
6837
6819
6809
6802
6793
6767
6762
6750
6728
6673
6663
6653
6637
6636
6635
6619
6616
6594
6527
6516
651
6494
648
6458
6437
642
6370
6353
6316
6288
6259
625
6239
6228
6221
6203
6200
6197
6189
614
6130
6123
611
6081
6056
6049
6030
6008
5982
5976
5933
5897
5844
5836
5809
5756
5727
5718
5697
5682
5669
5660
5602
5574
5540
5538
5531
5481
5475
5451
5420
5407
5379
5373
5368
5320
5317
5310
5298
5292
5277
5271
5239
5233
5232
5219
5216
5193
5144
5120
5112
5111
5091
5061
5046
4990
498
4971
4969
4950
4940
4939
4938
4925
4920
492
4898
4876
4873
487
4856
4807
4800
4772
4767
4747
4741
4740
473
4721
47
4685
4655
4641
4630
460
4585
458
4578
4557
4534
4530
4529
4526
4524
4520
4479
4471
4470
4452
4444
4438
4430
4422
4397
4368
4365
4355
4321
4299
4298
4275
4274
4220
4198
4190
4159
4143
4139
4077
4054
4049
4044
4039
4018
3970
3963
396
3949
3934
391
3848
3846
3828
3827
3822
3780
3756
3719
3696
3682
368
3662
3644
3636
3630
3623
3618
3561
3545
3519
3517
3494
3470
3414
3387
3382
3328
3319
3302
3295
3292
3291
3262
3254
3249
3241
3240
3218
3145
3144
3140
3110
3099
3083
3064
3042
30353
3035
30335
30333
30327
30294
30283
30271
30241
30181
30172
30171
30156
30139
30124
30120
3011
30100
30099
30020
30016
3001
29978
29976
29956
2990
29879
29869
29842
29832
29772
29732
29731
2970
29652
29649
29644
29640
29628
29627
29613
29604
29601
29584
29578
29555
29547
29541
2954
29525
29522
29504
29498
29449
2943
29405
29401
29345
29344
29307
29265
29260
29243
29235
2922
29212
29207
29179
29157
29144
29099
29095
29081
29057
29038
29036
29003
29000
28965
28964
28957
28943
28917
28909
28898
28874
28776
28768
28705
28685
28682
28648
28637
28628
28614
2861
2859
28568
2856
28549
28543
28533
28525
28514
28509
28503
285
28491
28461
28448
28438
28428
28394
28392
28350
28332
28329
28316
28261
28232
28161
2816
28136
28133
28131
28109
28099
28057
28042
28041
28025
28018
28010
27987
2797
27969
27950
27908
27893
27878
2787
27829
27767
27762
2775
27723
27703
27700
27688
27665
27653
27649
27622
27612
27583
27518
27506
2750
27475
27450
27438
27427
274
27380
2738
27375
27374
27370
27369
27363
27357
27353
27349
27344
27331
27323
27322
27321
2732
27308
27205
27196
27166
27160
27155
27151
27145
27139
27133
27095
27067
27063
27051
2705
27013
27
2698
26934
26928
26927
26898
26897
26862
26856
26855
26832
26825
26823
26810
26797
26766
26754
26748
26725
26694
26669
26639
26615
26589
26568
26564
26562
26538
26537
26526
26509
26492
26444
26437
26417
26393
26366
26336
26328
26313
26307
263
26285
2628
26272
26241
26238
26227
26213
26183
26175
2617
26154
26146
26108
26096
26082
26059
26034
2601
25993
2598
25945
25849
25848
25843
25828
25750
25716
25682
2568
25672
25658
25643
25638
25634
25597
25585
25572
25565
25563
25556
25504
25501
25496
25483
25473
2545
25442
25368
25343
25284
25277
25257
25219
25212
25203
25182
25174
25169
25162
25131
25130
25125
25124
25117
25112
25086
25085
25080
25008
24965
2484
24823
24822
24808
24798
24748
24733
24723
24714
24705
24703
24659
24656
24586
24583
24558
24540
24469
2446
24445
24443
24427
24426
24418
24352
24327
24252
24233
24213
24199
24195
24194
24169
24167
24101
24100
2410
24094
24078
24073
24058
24053
24041
24033
24012
24007
240
23978
23969
23953
2395
23945
23940
23926
23904
23888
2388
23832
23829
23817
23798
23786
23754
23743
23727
23717
23651
23648
23635
23619
23588
23576
23558
23532
23526
23513
23503
235
23485
23480
23475
23468
23461
23452
23415
23404
23394
23372
2337
23349
23316
233
23261
23259
23220
23182
23125
23121
23120
23084
23052
23025
22993
22986
22977
22949
22913
2286
22812
2281
22799
22775
22762
22737
22736
22721
22705
22690
22659
22652
22613
22596
22593
22569
22511
22495
22480
22459
22458
22447
22443
22419
22410
2240
22382
22367
22355
22325
22311
22275
22274
22253
22241
2224
22224
22208
22197
22191
22173
22160
22157
22131
22103
22051
22016
22014
220
2199
21987
21949
21942
21906
21891
21890
2188
21873
21871
2187
21857
21853
21771
21753
21748
21738
21726
21721
21720
21719
21695
21694
2169
21686
21680
2166
21655
21618
21613
21554
21552
21534
21524
21481
2148
21473
21450
21440
2143
21378
21371
21357
21329
21326
21322
2131
21245
21243
2124
21239
21209
21191
2115
21105
21092
21079
2106
2103
21015
21004
20990
2099
20983
20923
20921
2090
20892
20866
20852
20850
20823
20817
20791
20788
20785
20781
20762
20726
20715
20714
20677
20669
20668
2066
20656
20634
20614
20592
20585
20565
20563
20559
2055
20531
20481
20448
20447
20431
20429
20414
20357
20348
20337
20319
20270
20265
20201
20185
20168
20164
20163
20097
20089
2008
20062
20060
20048
20046
20015
19983
1995
19948
19938
19934
19912
19910
19897
19893
1989
19889
19886
19842
19826
19820
19813
19812
19800
19781
19753
19728
19696
19694
19688
19654
19644
19641
19637
19636
19604
19574
19554
19552
19551
19533
19509
19508
19506
19500
19492
19477
19464
19462
19436
19433
1943
19401
19396
19395
19382
1938
19375
19340
19339
19335
19328
19316
19301
19269
19227
19226
19224
19200
1918
19175
19143
19139
19129
19121
19104
19083
19078
19057
19052
19047
19013
18985
18970
18950
18947
18942
1894
18911
18890
18871
18870
18865
18855
18845
1882
1879
18785
18754
18740
18736
18728
18679
1862
18600
18581
18542
18540
18529
18505
18496
18483
18455
18451
1845
18443
18430
18371
1834
18339
18333
18319
18313
18304
18302
18290
18289
18282
18268
1826
18244
18239
1823
18198
18180
1815
18142
18132
18128
18079
18069
18066
18040
17983
17937
17935
17918
17913
17891
17889
17883
17861
17857
17856
1781
17804
17707
17701
17696
17675
17646
17644
17605
17572
17568
17525
17515
17494
17488
17482
17441
1744
17436
17434
17413
17393
17348
17325
17309
1730
17289
17281
17256
17255
17247
17246
17234
17229
17227
17225
17202
17170
17167
17144
17130
17081
17080
17062
17058
17048
17043
17018
17014
16997
16977
16957
16939
16931
16883
16868
16867
16856
16853
16851
16829
16825
16802
16784
16754
16648
1662
16614
16611
16598
16578
16575
16574
16572
16567
16542
1654
16524
16513
16459
16456
16430
16416
16403
16360
16337
16328
16325
16294
1629
16276
16274
16264
16247
16240
16230
16193
16190
16157
16133
1613
16122
16119
16045
16037
16023
16021
1602
15991
15972
15927
15912
1586
15848
15847
15826
15784
15766
15745
15731
15708
15707
15683
15682
15647
1562
15592
15584
15581
15562
15532
15531
15509
15506
15492
15469
15465
15456
15431
15419
15417
1539
15360
15337
15331
15318
15316
15314
15313
15303
15301
15299
15281
15274
15265
15259
15241
15234
15230
1523
15185
15130
15107
15098
15096
15094
15085
15069
1506
15057
15014
14976
14971
14950
14873
14868
14847
14823
14764
14757
14684
14668
14610
14587
14560
14547
14523
1451
14501
14497
14489
14485
14477
14454
14450
1444
14409
14395
14360
1433
14328
14325
14306
14286
14244
14242
14232
14208
14186
14145
14131
14123
141
14051
14045
14018
140
13995
13994
13971
1396
1394
13906
1390
13895
13882
13881
13869
13846
13839
1381
1378
13778
13721
13720
13712
13707
13697
13688
13657
13621
13613
13607
136
1357
13535
13529
13516
13489
13470
13462
13435
1341
13353
13337
13327
13317
13299
13274
13212
13178
13177
13174
1317
13167
13163
13125
13114
13036
13032
12983
12975
12966
12960
1292
12868
12855
12846
12820
12819
12790
12772
12763
1275
12710
12681
12672
12660
12659
12657
12640
12614
12597
12590
12582
1258
12567
12553
12534
12521
12520
12519
12482
12459
12446
12443
1242
12331
12321
12303
1230
12268
12256
1225
12248
12235
1222
12206
12202
12196
12163
12153
1211
12100
12091
12090
12056
12052
12029
12023
12021
11973
11962
11937
11912
11903
11845
11819
11801
11777
11766
11760
11745
11732
11707
11703
11688
11583
11538
11526
11513
11497
11444
11414
11402
11371
11349
11342
11327
11326
11295
1126
11220
11172
11160
1116
11137
11100
11080
1106
11057
11029
11010
10988
10979
10941
10937
10935
10931
10922
1091
109
10898
10893
10879
10874
10841
10837
10819
10816
10811
10786
10777
10760
10724
10723
10722
10703
10674
10658
1065
10647
10646
10645
10639
10636
10631
10630
10596
10539
1053
10520
10505
1050
10492
10455
10452
10449
10446
10443
10411
1040
104
10390
10382
10324
10300
1030
10284
10260
10238
10206
10204
10169
10148
10138
10133
10108
10069
10063
10059
1004
10039
10026
10025
10019
