[PAD]
[UNK]
？
，
！
。
9995
9994
9985
9981
9980
9979
9963
9955
9947
9935
9933
9925
9907
9896
9895
9881
9866
9861
9860
9840
9830
9815
9810
981
9808
9805
979
9783
9779
9778
9771
9765
9763
976
9755
975
9742
9740
9737
9730
9717
9707
97
9688
9680
9672
9671
9635
9628
9620
9614
9610
9601
9597
9590
9585
9574
9565
9555
9538
9534
9533
9532
9531
9528
9519
9508
9507
95
9498
9486
945
9437
9428
9426
9424
9421
942
9410
9397
9384
9379
9376
9356
9351
9315
9309
9302
929
9288
9284
9283
9273
927
9268
9248
924
9210
9198
9192
9167
9155
9148
9141
9128
9115
9108
9100
9090
9067
9062
9053
9043
9042
9036
9023
9019
9007
9004
9000
8997
8994
8991
8984
8979
8974
8962
8950
8943
8942
8935
8929
8924
8910
891
89
8895
8884
8875
8868
8857
8856
8842
884
8836
8823
8812
881
8808
8774
8773
8771
8766
8757
8756
8750
8744
8739
8729
8728
8725
8718
8716
8711
8709
8696
8693
8679
8676
8651
8644
8641
8620
8619
8612
8606
8588
8579
8576
8565
8549
854
8536
8513
8503
85
8487
8482
8462
8456
8448
8424
8414
84
8396
8390
8372
8366
8360
836
8350
8347
8346
8343
8335
8327
8322
8313
8311
8307
83
8299
8282
8266
8258
8251
825
8247
8240
8237
8232
8224
8223
8222
8212
8210
8209
8208
8202
8194
8189
8184
8183
8174
8169
8164
8149
8147
8146
8139
8137
8126
8123
8100
809
8082
8080
8073
8067
8060
8057
8045
8043
8038
803
8022
8019
8
7994
7990
799
7987
7961
7955
7923
7918
7915
7914
7910
7908
7906
7876
7875
7868
7865
7851
7848
7832
7821
781
7809
7805
7800
7799
7787
7773
7740
7739
7722
7710
7708
7702
7694
7690
7689
7685
768
7661
7659
7649
7643
7640
7634
7604
760
7598
7577
7558
7548
7547
7531
7523
752
7512
7510
7505
750
75
7493
749
7481
7471
7469
7464
7456
7442
7440
7424
7419
7410
7390
7386
7367
7364
7360
7359
7342
7341
7329
7301
7286
7281
7278
7269
726
7257
7256
7251
7247
7241
7232
7230
7225
7222
7211
72
7196
7180
7158
7154
715
7137
7118
7078
7077
7057
7054
7052
705
7002
6989
6987
6986
6984
698
6972
697
6968
6964
6957
6948
6939
6931
6884
6882
6872
6851
6844
6842
6837
6832
683
682
6819
6817
6809
6805
6802
6793
6789
6767
6762
6750
6728
6719
6703
6680
6675
6674
6673
6663
6653
6637
6636
6635
6629
6619
6616
6601
6598
6594
6570
6567
6553
6530
6527
6517
6516
651
6509
6494
6489
6485
6480
648
6458
6454
6437
642
6413
6406
6399
6394
639
6380
6370
6368
6353
6337
6336
6323
6316
6315
6312
63
6288
6285
6284
6279
6268
6266
6259
6258
6251
625
6239
6231
6228
6221
6203
6200
6197
6191
6189
6180
6171
614
6130
6123
611
6082
6081
6056
6049
6048
6042
6040
6033
6030
602
6008
6005
5982
5976
5962
5956
5948
5933
5931
5914
59
5897
5890
5878
5854
5844
5836
5834
5828
582
5809
5756
5750
5732
5727
5718
5710
5703
5697
5683
5682
5678
5669
5663
5660
566
5655
5645
5637
5635
5629
5609
5602
5594
5574
5555
5540
5538
5534
5533
5532
5531
5524
5512
5506
550
5489
5481
5475
5451
5433
5428
5424
5420
5418
5408
5407
5379
5373
5371
537
5368
5356
5351
5346
5331
5323
5320
5317
5310
5308
5298
5296
5292
5288
5285
5277
5271
5263
5239
5238
5233
5232
5221
5219
5216
5203
5197
5193
5192
5144
513
5124
5121
5120
5119
5112
5111
511
5108
5091
5089
5084
5083
5077
5061
5046
5043
5037
5032
5015
5012
4990
498
4971
4969
4967
4966
4953
4950
4940
4939
4938
4934
493
4926
4925
4920
492
4898
489
4876
4873
487
4856
4855
4837
4836
4827
4819
4815
4807
4806
4800
4772
4767
4759
4754
4751
4747
4745
4741
4740
4731
473
4727
4721
472
47
4685
4677
4667
4657
4655
4641
4631
4630
463
4625
4604
460
4585
4581
458
4578
4575
4557
4556
454
4534
4530
4529
4528
4526
4524
4522
4520
450
4496
4481
4479
4472
4471
4470
4464
446
4452
4444
4440
4438
4430
443
4428
4426
4422
4403
4398
4397
4370
4368
4365
4355
4353
4351
4332
4321
432
4299
4298
4290
4275
4274
4260
4243
4235
4230
4225
4220
4219
4211
4202
4198
4197
4190
419
4180
4179
4165
4159
4143
4139
413
412
4106
4092
4077
4054
4053
4049
4044
4039
4018
4014
4006
4004
4000
3998
3994
3970
3963
396
3953
3949
3940
394
3938
3934
3923
3918
3912
391
3870
3848
3846
3844
3840
3828
3827
3822
3795
3788
3784
3781
3780
3775
3764
3756
3745
3734
3728
3719
3714
3712
3696
3682
368
3664
3662
3658
3644
3639
3636
3630
3623
3618
3605
3601
358
3561
3545
3526
3519
3517
3499
3494
3479
3470
3467
3449
3422
3414
341
3409
3396
3387
3385
3382
3378
336
3351
3341
3328
3319
3302
3295
3292
3291
3290
3269
3263
3262
3261
3254
3249
3241
3240
3239
3218
3211
3163
3157
3145
3144
3140
3133
3110
3109
3099
3095
3083
3071
3064
3061
3053
3046
3043
3042
3037
30353
3035
30335
30333
30327
30299
30294
30292
30283
30271
30250
3025
30249
30241
30208
30192
30186
30185
30181
30172
30171
30170
30156
30150
30139
30131
30124
30120
30116
30111
3011
30104
30100
30099
30096
30075
30072
30037
30033
30020
30016
3001
30006
30005
29992
29978
29976
29956
29955
2995
29940
29908
29902
2990
29892
29891
29882
29879
29869
29847
29842
29832
29819
29810
29797
29785
29772
29759
2975
29732
29731
2973
29708
29704
2970
2969
29660
29656
29652
2965
29649
29646
29644
29640
29628
29627
29625
29618
29613
29610
29604
29601
29598
29584
29578
29555
29547
29541
2954
29538
29533
29525
29523
29522
29508
29504
29503
29498
29455
29449
2943
29405
29403
29401
2940
2937
29345
29344
29323
29322
2932
29307
29296
29295
29289
29265
29260
29243
29235
29224
2922
29212
29210
29207
29192
29183
29179
29164
29157
29146
29144
29114
29112
2911
2910
29099
29095
29088
29085
29081
29080
29077
29065
29058
29057
29054
29051
29038
29036
29015
29003
29000
2899
28977
28965
28964
28957
28954
28947
28943
28917
28909
28905
28900
28898
28874
28860
28825
2881
2880
28783
28776
2877
28768
28751
28709
28705
287
28685
28682
28675
28648
28637
28633
28630
28628
2862
28614
2861
2859
28581
28572
28568
2856
28553
28549
28543
28535
28533
28525
28517
28516
28514
28509
28503
285
28491
28476
28475
28463
28461
28448
28438
28428
28426
28413
28408
28396
28394
28392
28376
28363
28350
28332
28329
28322
2832
28316
28313
28291
28287
28283
28261
28256
28248
28232
28205
28204
28171
28161
2816
28144
28139
28136
28133
28131
28109
28102
28099
28084
28079
28071
28057
28042
28041
28025
28023
28021
28018
28010
28000
27987
2797
27969
27963
27950
27928
27908
27906
27901
27893
27878
2787
27854
27836
27829
27826
27779
27767
27762
2775
27740
27731
27723
27722
27714
27703
27700
27699
27688
27679
27665
27660
27656
27653
2765
27649
27623
27622
27612
27583
27564
27518
27515
27506
2750
27482
27475
2747
27454
27450
27438
27434
27432
27427
27405
274
27399
27397
27396
2739
27383
27380
2738
27375
27374
27370
27369
27363
27360
27359
27357
27353
27349
27344
27336
27331
27328
27323
27322
27321
2732
2731
27308
27294
27235
27205
27200
2720
27196
27185
27173
27168
27166
27162
27160
27155
27151
27145
27139
27134
27133
2711
27095
27091
2709
27077
27070
27067
27063
27057
27051
2705
27043
27013
27
2698
26953
26934
2693
26928
26927
26923
269
26898
26897
26862
26856
26855
26848
26832
26825
26823
26810
26802
26797
26766
26765
26754
26748
26743
2673
26729
26725
26694
26687
26671
26670
26669
26664
26661
26639
2663
26615
26594
26589
26580
26568
26564
26562
26539
26538
26537
26535
26526
26509
26500
26494
26492
26465
26462
26457
26455
26444
26440
26437
26417
26410
26393
26366
26363
2634
26336
26333
26328
26315
26313
26311
26307
26300
263
26297
26289
26285
2628
26272
26267
26241
26238
26227
26221
26219
26213
26209
26189
26183
26178
26175
26174
2617
26165
26163
26154
26150
26146
26142
26141
26108
2610
26099
26096
26082
26061
26060
26059
26041
26034
2601
26000
25993
25986
25984
2598
25955
25945
25944
25942
25930
25921
25918
25902
25882
25859
25849
25848
25846
25843
25839
25829
25828
25819
25812
25807
25800
25791
25756
25751
25750
25749
25747
25732
25716
25687
25682
2568
25672
25658
25657
25654
25643
25638
25634
25606
25597
25593
25585
25576
25572
25565
25563
25556
25536
25511
25504
25501
2550
25496
25486
25483
25473
2545
25442
25427
2540
254
25398
25377
25376
25368
25367
25346
25344
25343
25316
25290
25284
25277
25263
25262
25257
25240
25230
25219
25212
25203
25198
25182
25174
25171
25169
25163
25162
25157
25145
25143
25139
25133
25131
25130
25129
25125
25124
25117
25112
25105
25086
25085
25080
25071
25047
25024
2502
25008
25
24989
24982
24965
24960
24948
2494
24926
24909
24905
24875
2484
24824
24823
24822
2481
24808
24798
24795
24790
24789
24786
24766
24754
24748
24741
24735
24733
24723
24715
24714
24705
24703
24680
24675
24670
24660
2466
24659
24656
24651
24642
24640
24626
24624
24595
24593
24586
24583
24581
24574
24569
24558
2455
24548
24540
24525
24509
24469
24465
2446
24457
24455
24445
24443
24438
24427
24426
24418
24416
24413
24377
24372
24360
24352
24350
24349
24327
24288
24267
24261
24252
24233
24213
24210
24199
24195
24194
24169
24167
24162
24158
24153
24125
24111
24109
24101
24100
2410
24094
24078
24073
24066
24061
24058
24053
24041
24033
24014
24012
24007
24000
240
23982
23980
23978
23969
23960
23958
23953
2395
23945
23940
23926
23910
23904
23897
23889
23888
23887
23880
2388
23868
23864
23860
23848
23835
23832
23829
23817
23798
23796
23789
23786
23774
23756
23754
23743
23737
23732
23727
23722
23717
23707
23669
23653
23652
23651
23648
23641
23640
23636
23635
23628
23624
23619
23612
23601
23598
23588
23586
23576
23558
23533
23532
23526
23520
23513
23503
235
23485
23480
23475
23468
23461
23452
23420
23415
23407
23404
23400
23397
23395
23394
23381
23372
2337
23355
23352
23349
23332
23316
233
23279
23276
23266
23261
23259
23249
23248
23226
23220
23209
23192
23182
23174
23173
2316
23152
23150
23146
23137
23132
23126
23125
23122
23121
23120
23118
23101
23091
23084
23055
23052
23048
23035
23025
23010
2301
23008
22999
22993
22986
22977
22958
22949
2294
22933
22920
22913
22909
22894
22885
2286
22815
22812
2281
22799
22793
22792
22775
22774
2277
22762
22758
22747
22743
22737
22736
22721
22705
22690
22683
22675
22666
22659
22652
22649
22633
22626
22613
22611
22596
22593
22569
22542
22511
22504
22495
22480
22475
2247
22468
22464
22459
22458
22456
22447
22445
22443
22419
22410
2241
2240
22382
22378
22367
22355
22347
22338
22325
22314
22311
22293
22275
22274
22263
22253
22249
22247
22241
2224
22235
22224
2222
22208
22204
22197
22191
22173
22160
22157
22131
22103
2206
22057
22051
22028
22017
22016
22014
22007
220
2199
21987
21953
21949
21942
21940
21938
21936
21906
21899
21894
21891
21890
21883
2188
21874
21873
21871
21870
2187
2186
21857
21853
21828
21823
21820
21803
21794
21776
21771
21753
21748
21744
21739
21738
21726
21721
21720
21719
21695
21694
21692
21690
2169
21686
21680
2168
21666
2166
21655
21654
2165
21649
21624
21618
21613
21611
21603
21554
21552
21534
21524
21517
21490
21481
2148
21473
21457
21455
21450
21449
21440
2143
21405
21389
21378
21371
21364
2136
21357
21344
21343
2133
21329
21326
21322
2131
21296
21285
21275
21265
21259
21251
21245
21243
2124
21239
21209
21191
2118
21159
2115
21149
2114
21114
21105
21092
21079
21070
2106
21054
2103
21015
21010
21004
21002
20993
20990
2099
20983
20972
20957
20950
20931
20923
20921
20916
20909
20908
20904
2090
20892
20868
20867
20866
20864
20862
20852
20850
20843
20823
20817
20810
20803
20801
20796
20791
20788
20785
20783
20782
20781
20776
20763
20762
20748
20728
20726
20723
20715
20714
20693
20688
20677
20669
20668
20665
2066
20656
20634
20621
20619
20616
20614
20607
20605
20603
20599
20593
20592
20585
20565
20563
20559
2055
20548
20531
2052
20510
20508
20501
205
20481
20461
2046
20458
20449
20448
20447
20445
20440
20431
20429
20428
20419
20414
20408
20404
20357
20348
20337
2033
20328
20326
20319
20318
20314
20308
20302
20287
20270
20265
20259
20244
20241
20237
20235
20231
20212
20208
20205
20204
20201
20194
20193
20185
20168
20164
20163
20150
20149
20126
20100
20097
20089
20080
2008
20078
20070
20064
20062
20061
20060
20048
20046
20042
20023
20019
20015
20010
19983
1997
19965
19956
19954
1995
19948
19938
19934
19931
19922
19912
19911
19910
19901
19897
19893
19892
1989
19889
19886
19885
19877
19874
19855
19849
19842
19838
19826
19820
19816
19813
19812
19800
19794
19793
19781
19753
19733
1973
19728
19709
19701
19696
19694
19688
19683
19673
19654
19644
19642
19641
19637
19636
19604
19597
19595
1958
19574
19554
19552
19551
1955
19539
19533
19521
1951
19509
19508
19506
19500
19497
19492
19477
19464
19463
19462
19458
19438
19436
19433
1943
19429
19404
19401
19396
19395
19382
1938
19375
19373
19370
19366
19352
19351
19349
19340
19339
19335
19330
19328
19319
19317
19316
19311
19301
19298
19286
19273
1927
19269
19255
19254
19250
19227
19226
19224
19200
1918
19175
19154
19143
19139
19129
19125
19121
1912
19116
19114
19108
19104
19089
19085
19083
19082
19078
19062
19057
19052
19047
19024
19013
18985
18970
18961
18950
18947
18942
1894
18916
18911
18895
18890
18888
18871
18870
18865
18855
18851
1885
18845
18834
1882
18817
1881
18801
1880
18792
18790
1879
18787
18785
18775
18755
18754
18743
18740
18736
18728
1869
18679
18675
18670
18661
18647
1862
18602
18600
18594
18581
18560
18542
18540
18532
18529
18505
18504
18499
18496
18483
18468
18456
18455
18451
1845
18443
18430
18426
18417
1841
18374
18371
18368
18359
18354
1834
18339
18333
18332
18327
18319
18313
18304
18302
18290
18289
18282
18268
18264
1826
18244
18239
1823
18229
18226
18206
18198
18193
18190
18180
18179
1815
18142
18133
18132
18131
18130
18128
1811
18100
18079
18069
18067
18066
18047
18040
18003
17997
17988
17983
17969
17960
17954
17942
17941
17937
17935
17926
17919
17918
17913
17909
17908
17907
17891
17889
17883
17869
17861
17857
17856
17853
1781
17804
1780
1776
1775
17730
17723
17709
17707
17701
17696
17675
17653
17646
17644
1764
17615
17605
17601
17597
17589
17575
17572
17568
17552
17525
17515
17503
17494
17488
17482
1746
17441
1744
17436
17435
17434
1742
17413
17409
17404
17401
17393
17372
17362
17357
17350
17348
17337
17332
17325
17309
1730
17289
17281
17265
17260
1726
17256
17255
17247
17246
17240
17234
17229
17227
17225
17214
17202
17199
17184
17170
17168
17167
17144
17138
17130
17126
17081
17080
17065
17062
1706
17058
17048
17043
17040
17032
17018
17014
17006
17
16997
16988
16977
16964
16957
16939
16931
16929
16902
16883
16868
16867
16865
16860
16856
16853
16851
16829
16825
16820
16813
16807
16804
16802
16793
16784
16762
16754
16752
1675
16745
16735
16675
16648
16647
16640
16638
16634
16631
1662
16616
16614
16611
16609
16608
16598
16578
16576
16575
16574
16572
16567
16542
1654
16524
16513
16511
16506
16495
16483
16459
16456
16450
1644
16433
16430
16416
16410
16403
16397
16365
16360
16358
16343
16337
16328
16325
16316
16304
16294
1629
16276
16274
16271
16264
16249
16247
16240
16234
16230
1621
16209
16205
16193
16190
1619
16189
16188
16182
16164
16163
16157
16133
1613
16122
16119
16111
161
16079
16071
16051
16045
16042
16037
16032
16023
16021
1602
16014
16009
15991
15987
15979
15972
15959
15941
15938
15932
1593
15927
15912
15901
15886
1587
1586
15848
15847
15842
15830
15826
15794
15788
15785
15784
15774
15766
15758
1575
15745
15736
15731
15708
15707
15697
15683
15682
15667
15647
15629
1562
15604
15592
15584
15581
15565
15562
15556
15536
15532
15531
15526
15520
15509
15506
15492
15490
1548
15475
15469
15465
15460
15456
15439
15432
15431
15428
15427
15419
15417
15405
15401
15398
1539
15385
15360
15355
15349
15340
15337
15331
15318
15316
15315
15314
15313
15306
15305
15303
15301
15300
15299
1529
15281
15280
15274
15265
15259
15248
15241
15234
15230
1523
15225
15221
15185
15172
15165
15130
15107
15098
15096
15094
15085
15069
15063
15062
1506
15057
15048
15045
15043
15037
15019
15014
14976
14971
14962
14950
14949
14940
14896
14873
14868
14847
14846
14841
14823
14818
14795
14776
14765
14764
14757
14756
14754
14751
14732
14728
14695
14684
14678
14668
14662
14657
14656
14654
14626
14621
14616
14610
14597
1459
14587
14568
14560
14547
14533
14523
14521
1451
14504
14501
14497
14489
14485
14477
14455
14454
14450
1444
14431
14421
14409
14405
14401
14395
14380
14365
14364
14360
14339
1433
14328
14325
14314
14313
14306
14301
1429
14286
14272
14244
14242
14232
1423
14221
14213
14208
14203
14201
14186
14150
14145
14142
14131
14123
141
1408
14075
1406
14051
14045
14034
14018
140
13995
13994
13990
13977
13971
13969
13962
1396
1394
13918
13916
13906
1390
13895
13884
13882
13881
13872
13869
13859
13853
13846
13839
13829
13821
13814
1381
13809
13805
13783
1378
13778
13767
13737
13721
13720
13716
13712
13707
13700
1370
13697
13693
13688
13674
13658
13657
13656
13634
13627
13621
13616
13613
13607
13603
136
13589
13577
1357
13569
13562
13554
13553
13537
13535
13532
13529
13516
13489
13471
13470
13467
13462
13458
13447
13445
13439
13435
13433
13420
13415
1341
13374
13363
13355
13353
13347
13343
13337
13328
13327
13317
13315
13306
13299
13296
13274
13272
13261
13248
13232
13224
13212
13208
13197
13178
13177
13174
13170
1317
13167
13163
13155
13125
13114
13093
13091
13083
13069
13050
13046
13045
13036
13032
1301
12998
12983
12975
12966
12960
12921
1292
12899
12872
12868
12862
12855
12846
12835
12820
12819
12790
12788
12772
12766
12763
1275
12742
1274
12710
1271
12706
12701
127
12681
12672
12660
12659
12657
12655
12640
12636
12631
12614
12600
12597
12590
12582
1258
12576
12567
12564
12553
12534
12530
12521
12520
12519
12507
12489
12482
12481
12459
12446
12443
1243
12425
1242
12414
12398
12373
12369
12367
12331
12321
12311
12303
1230
12268
12256
1225
12248
12246
12235
12231
1222
12206
12202
12196
12186
12176
12170
12165
12163
12162
12153
12125
12113
1211
12108
12100
12091
12090
12076
12075
12061
12056
12055
12052
12029
12023
12021
12006
11995
11990
11989
11973
11969
11962
11957
11955
11944
11942
11937
11912
11903
1185
11846
11845
11843
11819
11818
11817
11801
11794
11793
11777
11766
11765
11763
11760
11745
11732
11728
11707
11703
11699
11693
11688
11654
11631
11630
11624
11606
11583
11577
11568
11561
11556
11542
11538
11536
11528
11526
11513
11506
115
11497
11444
11426
11419
11414
11402
11396
11395
11390
11382
11375
11371
11349
11342
11341
11327
11326
11319
11305
113
11296
11295
11283
11282
1126
11259
11255
11252
11243
11220
11206
11192
11172
11160
1116
11143
11137
11120
11118
11115
11103
11100
11080
1106
11057
11034
11029
11021
11020
1102
11019
11010
11006
10988
10979
10974
10954
10953
10950
10941
10937
10935
10931
10922
1091
10902
109
10898
10893
10889
10879
10874
10872
10864
10841
10837
10824
10823
10821
1082
10819
10816
10811
10786
10777
10760
10750
10746
10741
10724
10723
10722
10715
10703
10701
10689
10677
10676
10674
10668
10661
10658
1065
10647
10646
10645
10639
10636
10631
10630
10620
10596
10593
10569
10564
10551
10548
10543
10539
1053
10520
10511
10508
10505
1050
10492
10470
10455
10452
10449
10446
10443
10438
10429
10425
10411
10403
1040
104
10390
10383
10382
10380
10355
10341
10335
10324
10300
1030
10297
10291
10284
10274
10268
10260
10250
10247
10238
10211
10206
10204
10188
10169
10160
10154
10152
10148
10138
10133
10127
10109
10108
101
10096
10077
10069
10067
10063
10059
10050
10042
10040
1004
10039
10037
10026
10025
10019
10004
